bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
/*
 * Copyright (C) 2017 XRADIO TECHNOLOGY CO., LTD. All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *    1. Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *    2. Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the
 *       distribution.
 *    3. Neither the name of XRADIO TECHNOLOGY CO., LTD. nor the names of
 *       its contributors may be used to endorse or promote products derived
 *       from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <assert.h>
#include <FreeRTOS.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <task.h>
#include <time.h>
#include <wifi_mgmr_ext.h>
#include <lwip/tcpip.h>
#include <lwip/netdb.h>
#include <lwip/tcp.h>
#include <lwip/udp.h>
#include <lwip/altcp.h>
#include <lwip/altcp_tcp.h>
#include <lwip/err.h>
#include "atcmd/at_command.h"
#include "at_private.h"
#include <easyflash.h>
#include <bl602_uart.h>
#include "at_server.h"
#include "hal_hbn.h"
#include "bl_hbn.h"
#if 0
#include "kernel/os/os.h"
#include "sys/interrupt.h"

#include "common/cmd/cmd_ping.h"
#include "common/cmd/cmd_util.h"
#include "common/cmd/cmd_wlan.h"
#include "net/wlan/wlan.h"

#include "common/framework/net_ctrl.h"
#include "lwip/inet.h"

#include "driver/chip/hal_rtc.h"

#include "image/fdcm.h"

#include "errno.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"
#include "serial.h"

#include "ap_socket.h"
#include "common/framework/sys_ctrl/sys_ctrl.h"
#include "common/framework/sysinfo.h"
#include "driver/chip/hal_gpio.h"
#include "driver/chip/hal_wdg.h"
#include "lwip/dns.h"
#include "net/wlan/wlan_ext_req.h"

#include "ota/ota.h"

#include "atcmd.h"
#include "driver/chip/hal_wakeup.h"
#endif
#include <hal_sys.h>
#include "bl_gpio.h"
#include "hal_gpio.h"
#include <http_client.h>

#define FUN_DEBUG_ON 0

#if FUN_DEBUG_ON == 1
#define FUN_DEBUG(fmt...)                           \
  {                                                 \
    printf("file:%s line:%d ", __FILE__, __LINE__); \
      printf(fmt);                                    \
  }
#else
#define FUN_DEBUG(fmt...)
#endif

#define MANUFACTURER "BOUFFALOLAB"
#define MODEL "serial-to-wifi"
#define SERIAL "01234567"
//#define MAC               {0x00, 0x11, 0x22, 0x33, 0x44, 0x55}

#define CONFIG_FDCM_FLASH (0)

//#define CONFIG_FDCM_ADDR  0x120000UL
//#define CONFIG_FDCM_SIZE  0x10000UL

#define CONFIG_FDCM_ADDR (0x200000UL - 0x8000UL)
#define CONFIG_FDCM_SIZE (0x4000UL)

#define CONFIG_CONTAINNER_SIZE sizeof(config_containner_t)

#define MAX_SCAN_RESULTS 50
#define MAX_SOCKET_NUM 4
#define IP_ADDR_SIZE 15
#define SOCKET_CACHE_BUFFER_SIZE 1024

#define SERVER_THREAD_STACK_SIZE (1 * 1024)

typedef struct {
  s32 cmd;
  AT_ERROR_CODE (*handler)(at_callback_para_t *para, at_callback_rsp_t *rsp);
} callback_handler_t;

typedef struct {
  u32 cnt;
  at_config_t cfg;
} config_containner_t;

enum socket_state {
  SOCK_IDLE_CLOSE = 0,
  SOCK_SERVER_LISTENING,
  SOCK_CLIENT_CONNECTING,
  SOCK_CLIENT_CONNECTED
};

enum socket_type {
  SOCK_TYPE_TCP = 1,
  SOCK_TYPE_UDP,
  SOCK_TYPE_TLS
};

typedef struct {
  char ip[IP_ADDR_SIZE + 1];
  char hostname[AT_PARA_MAX_SIZE];
  u32 port;
  enum socket_type protocol;  // 1:TCP , 2:UDP , 3:TLS
  union {
    struct udp_pcb *udp;
    struct altcp_pcb *tcp;
    struct altcp_pcb *tls;
  } pcb;
  enum socket_state status;
} connect_t;

typedef struct {
  s32 count;
  connect_t connect[MAX_SOCKET_NUM];
} network_t;

typedef struct {
  s32 mode;  // 0:no connections 1: sta connections 2:ap connections
} system_status_t;

#if 0
typedef struct {
  u32 flag;
  s32 offset;
  s32 cnt;
  u8 buffer[SOCKET_CACHE_BUFFER_SIZE];
} socket_cache_t;
#endif

typedef struct {
  s16 port;
  s32 protocol;
} server_arg_t;

typedef struct {
  u32 flag;
  s16 port;
  s32 protocol;
  union {
    struct altcp_pcb *tcp;
    struct altcp_pcb *tls;
    struct udp_pcb *udp;
  } pcb;
} server_ctrl_t;

static server_arg_t g_server_arg;
static server_ctrl_t g_server_ctrl;
// static system_status_t g_status;
static u32 g_errorcode = 0;
static network_t networks;
static wifi_interface_t g_wifi_interface;

static u32 g_server_enable = 0;
static SemaphoreHandle_t g_server_sem;
// static uint16_t net_evevt_state = NET_CTRL_MSG_NETWORK_DOWN;
int is_disp_ipd = 1;

// cipsend data totlen
static int32_t cipsend_totlen = 0;

enum atc_cwjap_cur_type {
  ATC_CWJAP_CUR_OK = 0,
  ATC_CWJAP_CUR_TIMEOUT = '1',
  ATC_CWJAP_CUR_PSK_INVALID = '2',
  ATC_CWJAP_CUR_SSID_NOMATCH = '3',

};

extern int at_serial_lock(void);
extern int at_serial_unlock(void);

static AT_ERROR_CODE http_url_req(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipsend(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipstart(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipsendbuf(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipclose(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE tcpserver(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE set_apcfg(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwqap(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE deep_sleep(at_callback_para_t * para, at_callback_rsp_t * rsp);
static AT_ERROR_CODE cwmode_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwmode_cur_get(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwjap_cur(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cwjap_info(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE version(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE restory(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE uart_set(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE uart_get(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE scan(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE ap_sta_get(at_callback_para_t * para, at_callback_rsp_t * rsp);
static AT_ERROR_CODE sockon(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE reset(at_callback_para_t *para, at_callback_rsp_t *rsp);
static AT_ERROR_CODE cipstatus(at_callback_para_t *para, at_callback_rsp_t *rsp);

