bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
/* factory default */
static const at_config_t default_cfg = {
    .blink_led = 0,
    .wind_off_low = 0x0,
    .wind_off_medium = 0x0,
    .wind_off_high = 0x0,
    .user_desc = "XRADIO-AP",
    .escape_seq = "at+s.",
    .localecho1 = 0,
    .console1_speed = 115200,
    .console1_hwfc = 0,
    .console1_enabled = 0,
    .sleep_enabled = 0,
    .standby_enabled = 0,
    .standby_time = 10,
    .wifi_tx_msdu_lifetime = 0,
    .wifi_rx_msdu_lifetime = 0,
    .wifi_operational_mode = 0x00000011,
    .wifi_beacon_wakeup = 1,
    .wifi_beacon_interval = 100,
    .wifi_listen_interval = 0,
    .wifi_rts_threshold = 3000,
    .wifi_ssid = "iot-ap",
    .wifi_ssid_len = 6,
    .wifi_channelnum = 6,
    .wifi_opr_rate_mask = 0xFFFFFFFF,
    .wifi_bas_rate_mask = 0x0000000F,
    .wifi_mode = 1,
    .wifi_auth_type = 0,
    .wifi_powersave = 1,
    .wifi_tx_power = 18,
    .wifi_rssi_thresh = -50,
    .wifi_rssi_hyst = 10,
    .wifi_ap_idle_timeout = 120,
    .wifi_beacon_loss_thresh = 10,
    .wifi_priv_mode = 2,
    /*.wifi_wep_keys[4][16],*/
    /*.wifi_wep_key_lens[4],*/
    .wifi_wep_default_key = 0,
    /*.wifi_wpa_psk_raw[32],*/
    /*.wifi_wpa_psk_text[64],*/
    .ip_use_dhcp = 1,
    .ip_use_httpd = 1,
    .ip_mtu = 1500,
    .ip_hostname = "xr-iot-dev",
    .ip_apdomainname = "xradio.com",
    .ip_ipaddr = {192, 168, 0, 123},
    .ip_netmask = {255, 255, 255, 0},
    .ip_gw = {192, 168, 0, 1},
    .ip_dns = {192, 168, 0, 1},
    .ip_http_get_recv_timeout = 1000,
    .ip_dhcp_timeout = 20,
    .ip_sockd_timeout = 250,
};

static __always_inline int server_is_isr_context(void)
{
    return __get_IPSR();
}


static void server_mutex_lock(void)
{
    if (g_server_mutex == NULL) {
        g_server_mutex = xSemaphoreCreateRecursiveMutex();
    }
    xSemaphoreTakeRecursive(g_server_mutex, portMAX_DELAY);
}

static void server_mutex_unlock(void)
{
    if (g_server_mutex == NULL) {
        return;
    }

    xSemaphoreGiveRecursive(g_server_mutex);
}
#endif

u32 at_get_errorcode(void) { return g_errorcode; }

#if 0
s32 at_cmdline(char *buf, u32 size)
{
    u32 i;

    for (i = 0; i < size; i++) {
        if (buf[i] == AT_LF) {
            return i+1;
        } else if (buf[i] == AT_CR) {
            if (((i+1) < size) && (buf[i+1] == AT_LF)) {
                return i+2;
            } else {
                return i+1;
            }
        }
    }

    return -1;
}




static void at_wakeup_pin_irq_cb(void *arg)
{
    printf("SYSTE wake up!\r\n");
}

static int wkgpio_pins[] = {GPIO_PIN_4,GPIO_PIN_5,GPIO_PIN_6,GPIO_PIN_7,GPIO_PIN_7,\
                        GPIO_PIN_19,GPIO_PIN_20,GPIO_PIN_21,GPIO_PIN_22,GPIO_PIN_23};

void at_wakeup_gpio_init(int gpioId,int edge)
{
    GPIO_InitParam param;
    GPIO_IrqParam Irq_param;

    if(edge == 1)
    {
        param.driving = GPIO_DRIVING_LEVEL_1;
        param.pull = GPIO_PULL_DOWN;
        param.mode = GPIOx_Pn_F6_EINT;
        HAL_GPIO_Init(GPIO_PORT_A, wkgpio_pins[gpioId], &param);

        Irq_param.event = GPIO_IRQ_EVT_RISING_EDGE;
        Irq_param.callback = at_wakeup_pin_irq_cb;
        Irq_param.arg = (void *)NULL;
        HAL_GPIO_EnableIRQ(GPIO_PORT_A, wkgpio_pins[gpioId], &Irq_param);
        HAL_Wakeup_SetIO(gpioId, WKUPIO_WK_MODE_RISING_EDGE, GPIO_PULL_DOWN);
    }
    else if(edge == 0)
    {
        param.driving = GPIO_DRIVING_LEVEL_1;
        param.pull = GPIO_PULL_UP;
        param.mode = GPIOx_Pn_F6_EINT;
        HAL_GPIO_Init(GPIO_PORT_A, wkgpio_pins[gpioId], &param);

        Irq_param.event = GPIO_IRQ_EVT_FALLING_EDGE;
        Irq_param.callback = at_wakeup_pin_irq_cb;
        Irq_param.arg = (void *)NULL;
        HAL_GPIO_EnableIRQ(GPIO_PORT_A, wkgpio_pins[gpioId], &Irq_param);
        HAL_Wakeup_SetIO(gpioId, WKUPIO_WK_MODE_FALLING_EDGE, GPIO_PULL_UP);
    }

}

#endif
AT_ERROR_CODE callback(AT_CALLBACK_CMD cmd, at_callback_para_t *para, at_callback_rsp_t *rsp) {
  s32 i;

  FUN_DEBUG("callback cmd = %d\r\n", cmd);

  for (i = 0; i < TABLE_SIZE(callback_tbl); i++) {
    if (cmd == callback_tbl[i].cmd) {
      if (callback_tbl[i].handler != NULL) {
        return callback_tbl[i].handler(para, rsp);
      } else {
        /* FUN_DEBUG("callback cmd = %d is unimplimented!\r\n", cmd); */

        return AEC_UNDEFINED;
      }
    }
  }

  FUN_DEBUG("callback cmd = %d is unsupported!\r\n", cmd);

  return AEC_UNSUPPORTED;
}
#if 0

static AT_ERROR_CODE act(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec = AEC_OK;
    uint8_t ap_ssid[32+1];
    uint8_t ap_psk[] = "12345678";

    switch (para->cfg->wifi_mode) {
    case 0: /* IDLE */

        net_switch_mode(WLAN_MODE_STA);
        wlan_sta_disable();

        break;

    case 1: /* STA */

        net_switch_mode(WLAN_MODE_STA);
        wlan_sta_set(para->cfg->wifi_ssid, para->cfg->wifi_ssid_len, (uint8_t *)para->cfg->wifi_wpa_psk_text);
        wlan_sta_enable();

        break;

    case 2: /* AP */

        net_switch_mode(WLAN_MODE_HOSTAP);
        wlan_ap_disable();
        snprintf((char *)ap_ssid, 32, "xr-ap-%02x%02x%02x", para->cfg->nv_wifi_macaddr[3], para->cfg->nv_wifi_macaddr[4], para->cfg->nv_wifi_macaddr[5]);
        wlan_ap_set(ap_ssid, strlen((char *)ap_ssid), ap_psk);
        wlan_ap_enable();

        break;
#if 0
    case 3: /* IBSS */

        break;
#endif
    default:

        aec = AEC_PARA_ERROR;

        break;
    }

    return aec;
}
#endif
static AT_ERROR_CODE reset(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec = AEC_OK;

    at_dump("OK");

    vTaskDelay(pdMS_TO_TICKS(2));
    hal_reboot();

    return aec;
}
#if 0
static AT_ERROR_CODE mode(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE res = AEC_OK;
    s32 id;
    u8 *buffer;
    s32 len;
    s32 timeout_ms=10;
    fd_set fdset_r,fdset_w;
    int fd;
    struct sockaddr_in address;
    socklen_t addr_len;
    char ip[IP_ADDR_SIZE+1];
    s16 port;
    s32 protocol;

    if (!g_server_enable) { /* as client */
        id = 0;
        fd = networks.connect[id].fd;
        protocol = networks.connect[id].protocol;
        port = networks.connect[id].port;
        strncpy(ip, networks.connect[id].ip, sizeof(ip));

