bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
        if (networks.count > 0) {
            if (networks.connect[id].flag) {
                int rc = -1;
                struct timeval tv;

                FD_ZERO(&fdset_w);
                FD_ZERO(&fdset_r);
                FD_SET(fd, &fdset_w);
                FD_SET(fd, &fdset_r);

                tv.tv_sec = timeout_ms / 1000;
                tv.tv_usec = (timeout_ms % 1000) * 1000;

                rc = select(fd + 1, &fdset_r, NULL, NULL, &tv);
                if (rc > 0) {
                    if (FD_ISSET(fd, &fdset_r)) {
                        buffer = socket_cache[id].buffer;
                        len = SOCKET_CACHE_BUFFER_SIZE;

                        if (protocol == 0) { /* TCP */
                            rc = recv(fd, buffer, len, 0);
                        } else if (protocol == 1) { /* UDP */
                            address.sin_port = htons(port);
                            address.sin_family = AF_INET;
                            address.sin_addr.s_addr= inet_addr(ip);

                            addr_len = sizeof(address);

                            rc = recvfrom(fd, buffer, len, 0, (struct sockaddr *)&address, &addr_len);
                        }

                        if (rc > 0) {
                            /* received normally */
                            serial_write(buffer, rc);
                        } else if (rc == 0) {
                            /* has disconnected with server */
                            res = AEC_DISCONNECT;
                        } else {
                            /* network error */
                            res = AEC_NETWORK_ERROR;
                        }
                    }
                } else if (rc == 0) {
                    /* timeouted and sent 0 bytes */
                } else {
                    /* network error */
                    res = AEC_NETWORK_ERROR;
                }

                rc = select(fd + 1, NULL, &fdset_w, NULL, &tv);
                if (rc > 0) {
                    if (FD_ISSET(fd, &fdset_w)) {
                        buffer = para->u.mode.buf;
                        len = para->u.mode.len;

                        if (buffer != NULL && len >0) {
                            if (protocol == 0) { /* TCP */
                                rc = send(fd, buffer, len, 0);
                            } else if (protocol == 1) { /* UDP */
                                address.sin_port = htons(port);
                                address.sin_family = AF_INET;
                                address.sin_addr.s_addr= inet_addr(ip);

                                addr_len = sizeof(address);
                                rc = sendto(fd, buffer, len, 0, (struct sockaddr *)&address, sizeof(address));
                            }

                            if (rc > 0) {
                                /* do nothing */
                            } else if (rc == 0) {
                                /* disconnected with server */
                                res = AEC_DISCONNECT;
                            } else {
                                /* network error */
                                res = AEC_NETWORK_ERROR;
                            }
                        }
                    }
                } else if (rc == 0) {
                    /* timeouted and sent 0 bytes */
                } else {
                    /* network error */
                    res = AEC_NETWORK_ERROR;
                }
            } else {
                res = AEC_SWITCH_MODE;
            }
        } else {
            res = AEC_SWITCH_MODE;
        }
    } else { /* as server */
        if (!g_server_ctrl.flag) {
            g_server_ctrl.protocol = g_server_arg.protocol;

            server_mutex_lock();
            g_server_ctrl.conn_fd = g_server_net.conn_fd;
            g_server_ctrl.flag = g_server_net.flag;
            server_mutex_unlock();
        }

        if (g_server_ctrl.flag) {
            int rc = -1;
            struct timeval tv;

            port = g_server_ctrl.port;
            protocol = g_server_ctrl.protocol;
            fd = g_server_ctrl.conn_fd;

            FD_ZERO(&fdset_w);
            FD_ZERO(&fdset_r);
            FD_SET(fd, &fdset_w);
            FD_SET(fd, &fdset_r);

            tv.tv_sec = timeout_ms / 1000;
            tv.tv_usec = (timeout_ms % 1000) * 1000;

            rc = select(fd + 1, &fdset_r, NULL, NULL, &tv);
            if (rc > 0) {
                if (FD_ISSET(fd, &fdset_r)) {
                    buffer = socket_cache[MAX_SOCKET_NUM].buffer;
                    len = SOCKET_CACHE_BUFFER_SIZE;

                    if (protocol == 0) { /* TCP */
                        rc = recv(fd, buffer, len, 0);
                    } else if (protocol == 1) { /* UDP */
                        address.sin_port = htons(port);
                        address.sin_family = AF_INET;
                        address.sin_addr.s_addr= inet_addr(ip);

                        addr_len = sizeof(address);

                        rc = recvfrom(fd, buffer, len, 0, (struct sockaddr *)&address, &addr_len);
                    }

                    if (rc > 0) {
                        /* received normally */
                        serial_write(buffer, rc);
                    } else if (rc == 0) {
                        /* has disconnected with server */
                        if (protocol == 0) { /* TCP */
                            server_mutex_lock();
                            g_server_net.conn_fd = -1;
                            g_server_net.flag = 0;
                            server_mutex_unlock();

                            OS_SemaphoreRelease(&g_server_sem);

                            g_server_ctrl.flag = 0;
                        }

                        res = AEC_DISCONNECT;
                    } else {
                        /* network error */
                        res = AEC_NETWORK_ERROR;
                    }
                }
            } else if (rc == 0) {
                /* timeouted and sent 0 bytes */
            } else {
                /* network error */
                res = AEC_NETWORK_ERROR;
            }

            rc = select(fd + 1, NULL, &fdset_w, NULL, &tv);
            if (rc > 0) {
                if (FD_ISSET(fd, &fdset_w)) {
                    buffer = para->u.mode.buf;
                    len = para->u.mode.len;

                    if (buffer != NULL && len >0) {
                        if (protocol == 0) { /* TCP */
                            rc = send(fd, buffer, len, 0);
                        } else if (protocol == 1) { /* UDP */
                            FUN_DEBUG("Unsupported!\r\n");
                        }

                        if (rc > 0) {
                            /* do nothing */
                        } else if (rc == 0) {
                            /* disconnected with server */
                            res = AEC_DISCONNECT;
                        } else {
                            /* network error */
                            res = AEC_NETWORK_ERROR;
                        }
                    }
                }
            } else if (rc == 0) {
                /* timeouted and sent 0 bytes */
            } else {
                /* network error */
                res = AEC_NETWORK_ERROR;
            }
        } else {
            res = AEC_DISCONNECT;
        }
    }

    return res;

