bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
/** countdown - set timeout value in seconds
 * @param timer - timeout timer where the timeout value save
 * @param timeout - timeout in timeout seconds
 */
/*
static void countdown(Timer* timer, unsigned int timeout)
{
countdown_ms(timer, timeout * 1000);
}
*/

/** left_ms - calculate how much time left before timeout
 * @param timer - timeout timer
 * @return the time left befor timeout, or 0 if it has expired
 */
static int left_ms(Timer* timer)
{
    int diff = (int)(timer->end_time) - (int)(OS_TicksToMSecs(OS_GetTicks()));
    return (diff < 0) ? 0 : diff;
}

/** expired - has it already timeouted
 * @param timer - timeout timer
 * @return 0 if it has already timeout, or otherwise.
 */
static char expired(Timer* timer)
{
    return 0 <= (int)OS_TicksToMSecs(OS_GetTicks()) - (int)(timer->end_time); /* is time_now over than end time */
}

static AT_ERROR_CODE wifi(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    AT_ERROR_CODE aec = AEC_OK;

    switch (para->cfg->wifi_mode) {
    case 0: /* IDLE */
        aec = AEC_IMPROPER_OPERATION;
        break;

    case 1: /* STA */

        if (para->u.wifi.value == 0) {
            wlan_sta_disable();
        } else if (para->u.wifi.value == 1) {
            wlan_sta_enable();
        } else {
            aec = AEC_PARA_ERROR;
        }

        break;

    case 2: /* AP */

        if (para->u.wifi.value == 0) {
            wlan_ap_disable();
        } else if (para->u.wifi.value == 1) {
            wlan_ap_enable();
        } else {
            aec = AEC_PARA_ERROR;
        }

        break;

    case 3: /* IBSS */
        aec = AEC_IMPROPER_OPERATION;
        break;

    default:

        aec = AEC_PARA_ERROR;

        break;
    }

    return aec;
}

static AT_ERROR_CODE reassociate(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    wlan_sta_connect();

    return AEC_OK;
}

static AT_ERROR_CODE gpioc(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static AT_ERROR_CODE gpior(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static AT_ERROR_CODE gpiow(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    return AEC_OK;
}

static s32 freq_to_chan(s32 freq)
{
    s32 i;

    for (i = 0; i < TABLE_SIZE(channel_freq_tbl); ++i) {
        if(freq == channel_freq_tbl[i]) {
            break;
        }
    }

    if(i >= TABLE_SIZE(channel_freq_tbl)) {
        return -1;
    }

    return i+1;
}
#endif

extern char *wifi_mgmr_auth_to_str(uint8_t auth);

static void insert_sort(wifi_mgmr_ap_item_t *ap_ary, int *a, int n)
{
    int i, j, x;

    for(i = 1; i < n; i++){
        if(ap_ary[a[i]].rssi > ap_ary[a[i-1]].rssi){
            j= i-1;
            x = a[i];
            while(j>-1 && ap_ary[x].rssi > ap_ary[a[j]].rssi){
                a[j+1] = a[j];
                j--;
            }
            a[j+1] = x;
        }
    }
}

static void scan_result_sort(wifi_mgmr_ap_item_t *ap_ary, int cnt, uint8_t opt)
{
    int i;

    int *a = malloc(cnt * sizeof(int *));
    if (a == NULL) {
        printf("mem not enought\r\n");
        return;
    }

    for (i = 0; i < cnt; i++) {
        a[i] = i;
    }

    if (BIT_GET(opt, 5)) {
        insert_sort(ap_ary, a, cnt);
    }

    at_serial_lock();
    at_dump("+CWLAP:");
    for (i = 0; i < cnt; i++) {
        if (strlen((char *)ap_ary[a[i]].ssid) > 0) {
            at_dump_noend(AT_CMD_ECHOSTART"%02d", i);
            if (BIT_GET(opt, 1)) {
                at_dump_noend(",%s", ap_ary[a[i]].ssid);
            }
            if (BIT_GET(opt, 3)) {
                at_dump_noend(",%02x:%02x:%02x:%02x:%02x:%02x",
                              ap_ary[a[i]].bssid[0],
                              ap_ary[a[i]].bssid[1],
                              ap_ary[a[i]].bssid[2],
                              ap_ary[a[i]].bssid[3],
                              ap_ary[a[i]].bssid[4],
                              ap_ary[a[i]].bssid[5]);
            }
            if (BIT_GET(opt, 4)) {
                at_dump_noend(",%02d", ap_ary[a[i]].channel);
            }
            if (BIT_GET(opt, 2)) {
                at_dump_noend(",%02d", ap_ary[a[i]].rssi);
            }
            if (BIT_GET(opt, 0)) {
                at_dump_noend(",%s", wifi_mgmr_auth_to_str(ap_ary[a[i]].auth));
            }
            at_dump_noend(AT_CMD_TAILED);
            vTaskDelay(pdMS_TO_TICKS(5));
        }
    }
    at_serial_unlock();
    free(a);
}

static AT_ERROR_CODE scan(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
#if 0
    AT_ERROR_CODE aec = AEC_OK;
    int ret = -1;
    int size;
    char ssid[32+1];
    wlan_sta_scan_results_t results;

    if (para->cfg->wifi_mode != 1) { /* STA */
        return AEC_IMPROPER_OPERATION;
    }

    wlan_sta_scan_once();

    size = MAX_SCAN_RESULTS;

    results.ap = cmd_malloc(size * sizeof(wlan_sta_ap_t));
    if (results.ap == NULL) {
        aec = AEC_SCAN_FAIL;
    }

    if (aec == AEC_OK) {
        results.size = size;
        ret = wlan_sta_scan_result(&results);

        if (ret == 0) {
            /* cmd_wlan_sta_print_scan_results(&results); */
            int i;

            for (i = 0; i < results.num; i++) {
                memcpy(ssid, results.ap[i].ssid.ssid, results.ap[i].ssid.ssid_len);
                ssid[results.ap[i].ssid.ssid_len] = '\0';
                at_dump("%2d    BSS %02X:%02X:%02X:%02X:%02X:%02X    SSID: %-32.32s    "
                        "CHAN: %2d    RSSI: %d    flags: %08x    wpa_key_mgmt: %08x    "
                        "wpa_cipher: %08x    wpa2_key_mgmt: %08x    wpa2_cipher: %08x\n",
                        i + 1, (results.ap[i].bssid)[0], (results.ap[i].bssid)[1],
                        (results.ap[i].bssid)[2], (results.ap[i].bssid)[3],
                        (results.ap[i].bssid)[4], (results.ap[i].bssid)[5],
                        ssid, freq_to_chan(results.ap[i].freq),results.ap[i].level,
                        results.ap[i].wpa_flags, results.ap[i].wpa_key_mgmt,
                        results.ap[i].wpa_cipher,results.ap[i].wpa2_key_mgmt,
                        results.ap[i].wpa2_cipher);
            }
        }

