bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
        cmd_free(results.ap);
    }

    return aec;
#else
    AT_ERROR_CODE aec = AEC_OK;
    uint32_t cnt;
    int ret;
    wifi_mgmr_ap_item_t *ap_ary = NULL;
    uint8_t opt = 0;

    if (at_key_value_get(SAVE_KEY_WIFISCAN_OPT, &opt) != 0) {
        opt = 0xff;
    }
    ret = wifi_mgmr_all_ap_scan(&ap_ary, &cnt);
    if (ret != 0) {
        printf("wifi all ap scan error %d\r\n", ret);
    }
    else {
        printf("Scan done: %lu ap info\r\n", cnt);
        scan_result_sort(ap_ary, cnt, opt);
        if (ap_ary != NULL) {
            vPortFree(ap_ary);
        }
    }
    return aec;
#endif
}

static AT_ERROR_CODE version(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    at_dump("+GMR:fw:\"%s-%s\"", BL_SDK_PHY_VER, BL_SDK_RF_VER);

    at_dump("+GMR:sdk:\""BL_SDK_VER"\"");

    at_dump("+GMR:tm:\"%s %s\"",__DATE__,__TIME__);
    return AEC_OK;
}

static AT_ERROR_CODE restory(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\n");

    ef_env_set_default();

    return AEC_OK;
}

#if 0
// UART Config
static UART_CFG_Type uartCfg =
{
    160*1000*1000,                                        /* UART clock */
    115200,                                              /* UART Baudrate */
    UART_DATABITS_8,                                     /* UART data bits length */
    UART_STOPBITS_1,                                     /* UART data stop bits length */
    UART_PARITY_NONE,                                    /* UART no parity */
    DISABLE,                                             /* Disable auto flow control */
    DISABLE,                                             /* Disable rx input de-glitch function */
    DISABLE,                                             /* Disable RTS output SW control mode */
    UART_LSB_FIRST                                       /* UART each data byte is send out LSB-first */
};
static UART_FifoCfg_Type fifoCfg =
{
    .txFifoDmaThreshold     = 0x10,
    .rxFifoDmaThreshold     = 0x10,
    .txFifoDmaEnable        = DISABLE,
    .rxFifoDmaEnable        = DISABLE,
};
#endif

static AT_ERROR_CODE uart_get(at_callback_para_t * para, at_callback_rsp_t * rsp) {
  
//  para->u.uart.uartBaud = uartCfg.baudRate;
//  para->u.uart.dataBit = uartCfg.dataBits + 5;
//  para->u.uart.stopBit = uartCfg.stopBits + 1;
//  para->u.uart.parity = uartCfg.parity;
//
//  if (uartCfg.ctsFlowControl == ENABLE && uartCfg.rtsSoftwareControl == ENABLE) {
//    para->u.uart.hwfc = 3;
//  } else if (uartCfg.ctsFlowControl == DISABLE && uartCfg.rtsSoftwareControl == ENABLE) {
//    para->u.uart.hwfc = 1;
//  } else if (uartCfg.ctsFlowControl == ENABLE && uartCfg.rtsSoftwareControl == DISABLE) {
//    para->u.uart.hwfc = 2;
//  } else if (uartCfg.ctsFlowControl == DISABLE && uartCfg.rtsSoftwareControl == DISABLE) {
//    para->u.uart.hwfc = 0;
//  } else {
//    return AEC_CMD_ERROR;
//  }
  at_key_value_get(SAVE_KEY_UART_BAUD, &para->u.uart.uartBaud);
  at_key_value_get(SAVE_KEY_UART_DATABIT, &para->u.uart.dataBit);
  at_key_value_get(SAVE_KEY_UART_STOPBIT, &para->u.uart.stopBit);
  at_key_value_get(SAVE_KEY_UART_PARITY, &para->u.uart.parity);
  at_key_value_get(SAVE_KEY_UART_HWFC, &para->u.uart.hwfc);
  
  return AEC_OK;
}

static AT_ERROR_CODE uart_set(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    int ret;

    printf("at_para.baudrate = %d\r\n", para->u.uart.uartBaud);

    ret = at_serial_cfg_set(para->u.uart.uartBaud,
                            para->u.uart.dataBit,
                            para->u.uart.stopBit,
                            para->u.uart.parity,
                            para->u.uart.hwfc);
    if (ret != 0) {
        return AEC_PARA_ERROR;
    }
    at_key_value_set(SAVE_KEY_UART_BAUD, &para->u.uart.uartBaud);
    at_key_value_set(SAVE_KEY_UART_DATABIT, &para->u.uart.dataBit);
    at_key_value_set(SAVE_KEY_UART_STOPBIT, &para->u.uart.stopBit);
    at_key_value_set(SAVE_KEY_UART_PARITY, &para->u.uart.parity);
    at_key_value_set(SAVE_KEY_UART_HWFC, &para->u.uart.hwfc);

    return AEC_OK;
}

static AT_ERROR_CODE deep_sleep(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    uint32_t sleep_time = para->u.sleep.sleep_time;
    uint8_t weakup_pin = para->u.sleep.weakup_pin;
    FUN_DEBUG("----->\r\n");

    if ((weakup_pin != 7) && (weakup_pin != 8)) {
        return AEC_CMD_FAIL;
    }

    hal_hbn_init(&weakup_pin, 1);
    at_dump("OK");
    vTaskDelay(100);
    sleep_time = sleep_time * 1000;
    hal_hbn_enter(sleep_time);
    at_dump("+GSLP:WEAKUP");
    return AEC_NO_RESPONSE;
}

#if 0
/*
enum suspend_state_t {
    PM_MODE_ON              = 0,
    PM_MODE_SLEEP           = 1,
    PM_MODE_STANDBY         = 2,
    PM_MODE_HIBERNATION     = 3,
    PM_MODE_POWEROFF        = 4,
    PM_MODE_MAX             = 5,
};
*/
#include "pm/pm.h"

static AT_ERROR_CODE sleep(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("----->\r\n");

    if(para->u.sleep.sleepMode < 0 || para->u.sleep.sleepMode > 5) {
        printf("The sleep mode is not support \r\n");
        return AEC_CMD_ERROR;
    } else {
        at_dump("OK");

        at_wakeup_gpio_init(5,0);
        OS_MSleep(5);
        pm_enter_mode(para->u.sleep.sleepMode);

    }
    return AEC_BLANK_LINE;
}

static AT_ERROR_CODE wakeupgpio(at_callback_para_t * para, at_callback_rsp_t * rsp)
{
    FUN_DEBUG("-->%s\r\n",__func__);

    at_wakeup_gpio_init(para->u.wakeupgpio.gpioId,para->u.wakeupgpio.edge);

    return AEC_OK;
}
#endif

enum wlan_mode {
    WIFI_DISABLE = 0,
    WIFI_STATION_MODE,
    WIFI_SOFTAP_MODE,
    WIFI_AP_STA_MODE,
};

static char g_soft_ap_ssid[65] = {0};

static AT_ERROR_CODE __wifimode_set(int mode)
{
    memset(g_soft_ap_ssid, 0, sizeof(g_soft_ap_ssid));
    if (mode == WIFI_DISABLE) {
        wifi_mgmr_sta_disconnect();
        vTaskDelay(1000);
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
    } else if (mode == WIFI_STATION_MODE) {
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
        g_wifi_interface = wifi_mgmr_sta_enable();
    } else if (mode == WIFI_SOFTAP_MODE) {
        wifi_mgmr_sta_disconnect();
        vTaskDelay(1000);
        wifi_mgmr_sta_disable(NULL);
        wifi_mgmr_ap_stop(NULL);
        g_wifi_interface = wifi_mgmr_ap_enable();
    } else {
        printf("The mode is not support \r\n");
        return AEC_CMD_ERROR;
    }
    return AEC_OK;
}

