bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    if (psk_len > 0) {
        wifi_mgmr_ap_start(g_wifi_interface,
                           para->u.apcfgParam.ssid, 0,
                           para->u.apcfgParam.psk, 1);
    } else {
        wifi_mgmr_ap_start(g_wifi_interface,
                           para->u.apcfgParam.ssid, 0,
                           NULL, 1);
    }
    strcpy(g_soft_ap_ssid, para->u.apcfgParam.ssid);
    return AEC_OK;
}


static err_t tcp_receive_callback(void *arg, struct altcp_pcb *conn, struct pbuf *p, err_t err) {
  int linkid = (int)arg;
  struct pbuf *pt;

  if (linkid >= MAX_SOCKET_NUM) {
    printf("receive callback arg error!!!!\r\n");
    return ERR_ARG;
  }
  if (networks.connect[linkid].status != SOCK_CLIENT_CONNECTED) {
    printf("linkid %d connection status error!\r\n", linkid);
    return ERR_CONN;
  }
  if (p == NULL){
    networks.connect[linkid].status = SOCK_IDLE_CLOSE;
    at_dump("+IPS:%d,CLOSED", linkid);
    altcp_close(networks.connect[linkid].pcb.tcp);
    networks.connect[linkid].pcb.tcp = NULL;

    return ERR_OK;
  }
  at_serial_lock();
  at_dump("+IPD:");
  if (is_disp_ipd == 1) at_dump("%d,%d\r\n", linkid, p->tot_len);
  for (pt = p; pt; pt = pt->next) {
    at_data_output((char *)pt->payload, pt->len);
  }
  at_serial_unlock();
  // release recv window size
  altcp_recved(networks.connect[linkid].pcb.tcp, p->tot_len);
  //XXX(Zhuoran) pbuf need free?
  pbuf_free(p);
  return ERR_OK;
}

static err_t tcp_sent_callback(void *arg, struct altcp_pcb *conn, u16_t len) {
  int linkid = (int)arg;
  if (linkid >= MAX_SOCKET_NUM) {
    printf("receive callback arg error!!!!\r\n");
    return ERR_ARG;
  }
  if (networks.connect[linkid].status != SOCK_CLIENT_CONNECTED) {
    printf("linkid %d connection status error!\r\n", linkid);
    return ERR_CONN;
  }
  printf("linkid %d peer acknowlege %d\r\n", linkid, len);
  cipsend_totlen -= len;
  if (cipsend_totlen <= 0){
    at_dump("+IPS:%d,SEND DONE\n", linkid);
  }
  
  return ERR_OK;
}

// in this case, the pcb already freed
static void tcp_err_callback(void *arg, err_t err) {
  int linkid = (int)arg;
  if (linkid >= MAX_SOCKET_NUM) {
    printf("connected callback arg error!!!!\r\n");
    return ERR_ARG;
  }

  networks.connect[linkid].status = SOCK_IDLE_CLOSE;
  at_dump("+IPS:%d,FAILED", linkid);
  networks.connect[linkid].pcb.tcp = NULL;
  return ERR_OK;
}

static err_t tcp_connected_callback(void *arg, struct altcp_pcb *conn, err_t err) {
  int linkid = (int)arg;
  if (linkid >= MAX_SOCKET_NUM) {
    printf("connected callback arg error!!!!\r\n");
    return ERR_ARG;
  }
  if (err == ERR_OK) {
    networks.connect[linkid].status = SOCK_CLIENT_CONNECTED;
    at_dump("+IPS:%d,CONNECTED", linkid);
    // register recv callbacks
    altcp_recv(conn, tcp_receive_callback);
    altcp_sent(conn, tcp_sent_callback);
  } else {
    networks.connect[linkid].status = SOCK_IDLE_CLOSE;
    at_dump("+IPS:%d,FAILED", linkid);
    altcp_close(networks.connect[linkid].pcb.tcp);
    networks.connect[linkid].pcb.tcp = NULL;
  }
  return ERR_OK;
}

static void udp_receive_callback(void *arg, struct udp_pcb *pcb, struct pbuf *p, 
    const ip_addr_t *addr, u16_t port) {
  struct pbuf *pt;
  int linkid = (int)arg;
  if (linkid >= MAX_SOCKET_NUM) {
    printf("receive callback arg error!!!!\r\n");
    pbuf_free(p);
    return ;
  }
  if (networks.connect[linkid].status == SOCK_IDLE_CLOSE) {
    printf("linkid %d connection status error!\r\n", linkid);
    pbuf_free(p);
    return ;
  }
  at_serial_lock();
  at_dump("+IPD:");
  if (is_disp_ipd == 1) at_dump("%d,%d\r\n", linkid, p->tot_len);
  for (pt = p; pt; pt = pt->next) {
    at_data_output((char *)pt->payload, pt->len);
  }
  at_serial_unlock();
  pbuf_free(p);
  return ;
}

static AT_ERROR_CODE cipstart(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");
  int linkid                      = para->u.net_param.linkId;
  struct addrinfo *result         = NULL;
  struct addrinfo hints_tcp       = {0, AF_INET, SOCK_STREAM, IPPROTO_TCP, 0, NULL, NULL, NULL};
  struct addrinfo hints_udp       = {0, AF_INET, SOCK_DGRAM, IPPROTO_UDP, 0, NULL, NULL, NULL};

  if (linkid >= MAX_SOCKET_NUM) {
    return AEC_OUT_OF_RANGE;
  }

  rsp->status = 0;

  if (networks.connect[linkid].status != SOCK_IDLE_CLOSE) {
    sprintf(rsp->vptr, "+IPS:%d,ALREADY CONNECT", linkid);
    rsp->type = 1;
    rsp->status = 1;
    return AEC_SOCKET_EXISTING;
  }

  // FIXME(Zhuoran) PLZ check ip length
  strncpy(networks.connect[linkid].ip, para->u.net_param.hostname, IP_ADDR_SIZE);
  networks.connect[linkid].port = para->u.net_param.port;

  if (strcmp(para->u.net_param.networkType, "TCP") == 0) {
    networks.connect[linkid].protocol = SOCK_TYPE_TCP;
  } else if (strcmp(para->u.net_param.networkType, "UDP") == 0) {
    networks.connect[linkid].protocol = SOCK_TYPE_UDP;
  } else if (strcmp(para->u.net_param.networkType, "SSL") == 0) {
    networks.connect[linkid].protocol = SOCK_TYPE_TLS;
  } else {
    return AEC_PARA_ERROR;
  }

  if (networks.connect[linkid].protocol == SOCK_TYPE_TCP) {
    ip_addr_t ip_addr;
    int rc;

    //FIXME(Zhuoran) only support ipv4 now
    if ((rc = getaddrinfo(networks.connect[linkid].ip, NULL, &hints_tcp, &result)) == 0) {
      struct addrinfo *res = result;

      while (res) {
        if (res->ai_family == AF_INET) {
          result = res;
          break;
        }
        res = res->ai_next;
      }

      if (result->ai_family == AF_INET) {
        ip_addr_t tmp = IPADDR4_INIT(((struct sockaddr_in *)(result->ai_addr))->sin_addr.s_addr); 
        ip_addr = tmp;
      } else
        rc = -1;

      freeaddrinfo(result);
    }

    if (rc == 0) {
      //FIXME(Zhuoran) only support ipv4 now
      networks.connect[linkid].pcb.tcp = altcp_tcp_new_ip_type(IPADDR_TYPE_V4);
      if (networks.connect[linkid].pcb.tcp == NULL)
        return AEC_SOCKET_FAIL;

      altcp_arg(networks.connect[linkid].pcb.tcp, (void *)(intptr_t)linkid);
      rc = altcp_connect(networks.connect[linkid].pcb.tcp, &ip_addr, 
          networks.connect[linkid].port, tcp_connected_callback);
      if (rc != ERR_OK) {
        altcp_close(networks.connect[linkid].pcb.tcp);
        networks.connect[linkid].pcb.tcp = NULL;
        return AEC_CONNECT_FAIL;
      }
      altcp_err(networks.connect[linkid].pcb.tcp, tcp_err_callback);

