bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
      networks.connect[linkid].status = SOCK_CLIENT_CONNECTING;
    } else {
      return AEC_CONNECT_FAIL;
    }

    networks.count++;

    rsp->status = 0;
    return AEC_OK;
  } else if (networks.connect[linkid].protocol == SOCK_TYPE_UDP) {
    networks.connect[linkid].pcb.udp = udp_new_ip_type(IPADDR_TYPE_V4);
    if (networks.connect[linkid].pcb.udp == NULL){
        return AEC_SOCKET_FAIL;
    }
    if (udp_bind(networks.connect[linkid].pcb.udp, IP4_ADDR_ANY, 0) != ERR_OK) {
      udp_remove(networks.connect[linkid].pcb.udp);
      networks.connect[linkid].pcb.udp = NULL;
      return AEC_SOCKET_FAIL;
    }

    networks.connect[linkid].status = SOCK_CLIENT_CONNECTED;

    networks.count++;
    rsp->status = 0;
    return AEC_OK;
  } else {
    printf("not support tls now\r\n");
    return AEC_UNSUPPORTED;
  }
}

static AT_ERROR_CODE cipsendbuf(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");

  return AEC_OK;
}

static AT_ERROR_CODE cipclose(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");

  if (para->u.close_id.id < MAX_SOCKET_NUM) {
      if (networks.connect[para->u.close_id.id].status == SOCK_IDLE_CLOSE) {
          return AEC_SOCKET_EXISTING;
      }
      disconnect(para->u.close_id.id);
      //at_dump("+CIPCLOSE:%d", para->u.close_id.id);
  } else {
      return AEC_PARA_ERROR;
  }
  return AEC_OK;
}

#if 0
static AT_ERROR_CODE tcpservermaxconn(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
#endif

static err_t tcp_accept_callback(void *arg, struct altcp_pcb *new_conn, err_t err) {
  int linkid;
  ip_addr_t *remote_ip;

  if (err != ERR_OK){
    printf("accept error!\r\n");
    // XXX(Zhuoran) Is there a better way to deal with it?
    altcp_close(new_conn);
    return ERR_CONN;
  }
  // find free slot to put connection
  for (linkid = 0; linkid < MAX_SOCKET_NUM; linkid++) {
    if (networks.connect[linkid].status == SOCK_IDLE_CLOSE){
      memset(&networks.connect[linkid], 0, sizeof(networks.connect[linkid]));
      break;
    }
  }
  if (networks.connect[linkid].status != SOCK_IDLE_CLOSE) {
    printf("no avalible connect slot\r\n");
    // XXX(Zhuoran) Is there a better way to deal with it?
    altcp_close(new_conn);
    return ERR_CONN;
  }
  networks.count++;
  // fill up necessary field
  networks.connect[linkid].pcb.tcp = new_conn;
  networks.connect[linkid].status = SOCK_CLIENT_CONNECTED;
  networks.connect[linkid].protocol = SOCK_TYPE_TCP;
  remote_ip = altcp_get_ip(new_conn, 0);
  ipaddr_ntoa_r(remote_ip, networks.connect[linkid].ip, sizeof(networks.connect[linkid].ip));
  networks.connect[linkid].port = altcp_get_port(new_conn, 0);
  
  at_dump("+IPS:%d,CONNECTED", linkid);
  altcp_arg(new_conn, (void *)(intptr_t)linkid);
  altcp_recv(new_conn, tcp_receive_callback);
  altcp_sent(new_conn, tcp_sent_callback);
  altcp_err(new_conn, tcp_err_callback);
  return ERR_OK;
}

static AT_ERROR_CODE tcpserver(at_callback_para_t *para, at_callback_rsp_t *rsp) {
  FUN_DEBUG("----->\r\n");
  s32 protocol;
  int enable;

  enable = para->u.tcp_server.enable;
  protocol = SOCK_TYPE_TCP; //tcp

  if (enable) {
    if (!g_server_enable) {
      g_server_arg.port = para->u.tcp_server.port;
      g_server_arg.protocol = SOCK_TYPE_TCP;
      // too early
      memset(&g_server_ctrl, 0, sizeof(g_server_ctrl));

      if (protocol == SOCK_TYPE_TCP) { /* TCP */
        err_t err;
        g_server_ctrl.pcb.tcp = altcp_tcp_new_ip_type(IPADDR_TYPE_V4);
        if (g_server_ctrl.pcb.tcp == NULL) {
          return AEC_NOT_ENOUGH_MEMORY;
        }

        err = altcp_bind(g_server_ctrl.pcb.tcp, IP4_ADDR_ANY, g_server_arg.port);
        if (err != ERR_OK) {
          altcp_close(g_server_ctrl.pcb.tcp);
          g_server_ctrl.pcb.tcp = NULL;
          return AEC_BIND_FAIL;
        }

        // listen
        g_server_ctrl.pcb.tcp = altcp_listen_with_backlog(g_server_ctrl.pcb.tcp, 5);
        if (g_server_ctrl.pcb.tcp == NULL) {
          // listen failed , origin pcb has been freed
          return AEC_SOCKET_FAIL;
        }
        g_server_enable = 1;
        
        altcp_accept(g_server_ctrl.pcb.tcp, tcp_accept_callback);
        
        return AEC_OK;
      } else if (protocol == SOCK_TYPE_UDP) { /* UDP */

      }
      return AEC_OK;
    }
  } else {
    if (g_server_enable) {
      g_server_enable = 0;

      if (g_server_arg.protocol == SOCK_TYPE_TCP) {
        altcp_close(g_server_ctrl.pcb.tcp);
        g_server_ctrl.pcb.tcp = NULL;
      } else if (g_server_arg.protocol == SOCK_TYPE_UDP) { /* UDP */
        /* Do nothing */
      }
      return AEC_OK;
    }
  }

  return AEC_SOCKET_FAIL;
}
#if 0
static AT_ERROR_CODE cipdns_cur(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");
    ip_addr_t dnsip;

    memcpy((char *)(&dnsip), &para->u.set_dns.setdnsip, sizeof(at_ip_t));

    dns_setserver(0,&dnsip);
    return AEC_OK;

}

static AT_ERROR_CODE cipmux(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}


static AT_ERROR_CODE cipmode(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}

static AT_ERROR_CODE ciprecvdata(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
static AT_ERROR_CODE ciprecvmode(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    FUN_DEBUG("----->\r\n");

    return AEC_OK;
}
#endif

static SemaphoreHandle_t g_http_xSemaphore = NULL;
static void cb_httpc_result(void *arg, httpc_result_t httpc_result, u32_t rx_content_len, u32_t srv_res, err_t err)
{
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;
    printf("[HTTPC] Transfer finished err %d. rx_content_len is %lu\r\n", err, rx_content_len);
    if (rsp && (!rsp->vptr)) {
        at_dump_noend(AT_CMD_TAILED);
    }
    xSemaphoreGive(g_http_xSemaphore);
    if (err == 0) {
        at_dump("+RSP:OK");
    } else {
        at_dump("+RSP:%d", err);
    }
}

static err_t cb_httpc_headers_done_fn(httpc_state_t *connection, void *arg, struct pbuf *hdr, u16_t hdr_len, u32_t content_len)
{
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;

    printf("[HTTPC] hdr_len is %u, content_len is %lu\r\n", hdr_len, content_len);
    printf((char *)hdr->payload);
    if (rsp && (!rsp->vptr)) {
        at_dump_noend(AT_CMD_ECHOSTART);
        at_dump_noend("+HTTPC:%d,", content_len);
    }
    return ERR_OK;
}

static err_t cb_altcp_recv_fn(void *arg, struct altcp_pcb *conn, struct pbuf *p, err_t err)
{
    static int count = 0;
    at_callback_rsp_t *rsp = (at_callback_rsp_t *)arg;

    if (0 == ((count++) & 0x3F)) {
        puts("\r\n");
    }
    altcp_recved(conn, p->tot_len);
    if (rsp) {
        if (!rsp->vptr && p->tot_len) {
            at_data_output(p->payload, p->tot_len);
        } else if (strlen((char *)p->payload) <= rsp->vsize) {
            if (rsp->vptr) {
                strcpy(rsp->vptr, (char *)p->payload);
            }
        } else {
            printf("rsp buffer size not enought\r\n");
        }
    }
    //printf("%s\r\n", (char *)p->payload);
    pbuf_free(p);

    return ERR_OK;
}

static AT_ERROR_CODE http_url_req(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    char *uri = "/";
    char *param, *server_name;
    static httpc_connection_t settings;
    static httpc_state_t *req = NULL;
    in_addr_t ip_addr;
    char *p_port;
    int port = 80;

