bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
    if (g_http_xSemaphore == NULL) {
        g_http_xSemaphore = xSemaphoreCreateBinary();
    }
    server_name = pvPortMalloc(128);
    if (server_name== NULL) {
        return AEC_CMD_FAIL;
    }
    memset(&settings, 0, sizeof(settings));
    settings.use_proxy = 0;
    settings.req_type  = para->u.http_req.type;
    settings.content_type = para->u.http_req.content_type;
    settings.data = para->u.http_req.data;
    settings.result_fn = cb_httpc_result;
    settings.headers_done_fn = cb_httpc_headers_done_fn;

    if ((param = strstr(para->u.http_req.hostname, uri)) == NULL) {
        param = uri;
    }
    strcpy(server_name, para->u.http_req.hostname);
    server_name[param - para->u.http_req.hostname] = '\0';
    if ((p_port = strstr(server_name, ":")) != NULL) {
        p_port[0] = '\0';
        p_port++;
        port = atoi(p_port);
    }
    if ((ip_addr = inet_addr(server_name)) != INADDR_NONE) {
        httpc_get_file((const ip_addr_t* )&ip_addr,
                        port,
                        param,
                        &settings,
                        cb_altcp_recv_fn,
                        rsp,
                        &req);
    } else {
        httpc_get_file_dns(
                server_name,
                port,
                param,
                &settings,
                cb_altcp_recv_fn,
                rsp,
                &req);
    }

    if (xSemaphoreTake(g_http_xSemaphore, (TickType_t)-1) != pdTRUE) {
        vPortFree(server_name);
        return AEC_NETWORK_ERROR;
    }
    vPortFree(server_name);
    return AEC_OK;
}

// callback context
struct send_data_ctx {
  int linkid;
  uint8_t *buf;
};
// Send TCP/TLS data
static void tcp_send_data(void *arg){
  assert(arg != NULL);
  connect_t *conn;
  struct send_data_ctx *ctx = (struct send_data_ctx *)arg;
  assert(ctx->buf != NULL);

  conn = &networks.connect[ctx->linkid];
  
  altcp_write(conn->pcb.tcp, ctx->buf, cipsend_totlen, 0);
  free(arg);
}

// Send UDP data
static void udp_send_data(void *arg){
  assert(arg != NULL);
  connect_t *conn;
  struct send_data_ctx *ctx = (struct send_data_ctx *)arg;
  assert(ctx->buf != NULL);

  // create pbuf
  // copy data to pbuf
  // send data
  //

  free(arg);
}

static AT_ERROR_CODE cipsend(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    u8 *buffer;
    connect_t *conn;
    struct send_data_ctx *ctx;
    FUN_DEBUG("------>%s\r\n",__func__);

    if (para->u.sockw.id >= MAX_SOCKET_NUM) {
        return AEC_DISCONNECT;
    }
    conn = &networks.connect[para->u.sockw.id];
    if (conn->status != SOCK_CLIENT_CONNECTED) {
      printf("linkid %d is not connected!\r\n", para->u.sockw.id);
      return AEC_CMD_FAIL;
    }
    
    // Record the total length of the data in order to judge 
    // whether the transmission is completed in the asynchronous callback
    cipsend_totlen = para->u.sockw.len;
    
    if (conn->protocol == SOCK_TYPE_TCP || conn->protocol == SOCK_TYPE_TLS) {
      ctx = malloc(sizeof(struct send_data_ctx));
      if (ctx == NULL) {
        return AEC_NOT_ENOUGH_MEMORY;
      }
      
      ctx->linkid = para->u.sockw.id;
      ctx->buf = para->u.sockw.buf;
      tcpip_callback(tcp_send_data, (void *)ctx);
    } else if (conn->protocol == SOCK_TYPE_UDP) {
      ctx = malloc(sizeof(struct send_data_ctx));
      if (ctx == NULL) {
        return AEC_NOT_ENOUGH_MEMORY;
      }
      
      ctx->linkid = para->u.sockw.id;
      ctx->buf = para->u.sockw.buf;
      tcpip_callback(udp_send_data, (void *)ctx);
    } else {
      return AEC_UNSUPPORTED;
    }
    
    return AEC_OK;
}

#if 0
int is_netconnet_ap(void)
{
    if((net_evevt_state == NET_CTRL_MSG_NETWORK_UP) || (net_evevt_state == NET_CTRL_MSG_WLAN_CONNECTED))
        return 1;

    return 0;
}

typedef struct {
    GPIO_Pin    GPIONum;
    GPIO_Port   GPIOPort;
    GPIO_InitParam  GPIOPara;
} GPIO_CFG;
GPIO_CFG BoardGPIO[3]=
{
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}},
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}},
    {GPIO_PIN_19,GPIO_PORT_A,{GPIOx_Pn_F0_INPUT,GPIO_DRIVING_LEVEL_1,GPIO_PULL_NONE}}
};

static AT_ERROR_CODE sysiosetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp)
{

    if(para->u.setgpio_para.ID > 2)
        return AEC_PARA_ERROR;

    para->u.setgpio_para.ID -= para->u.setgpio_para.ID;

    BoardGPIO[para->u.setgpio_para.ID].GPIOPara.driving = GPIO_DRIVING_LEVEL_1;

    if(para->u.setgpio_para.mode <= 1)
        BoardGPIO[para->u.setgpio_para.ID].GPIOPara.mode = para->u.setgpio_para.mode;
    else
        return AEC_PARA_ERROR;

    if(para->u.setgpio_para.pull <= 2)
        BoardGPIO[para->u.setgpio_para.ID].GPIOPara.pull = para->u.setgpio_para.pull;
    else
        return AEC_PARA_ERROR;

    HAL_GPIO_Init(BoardGPIO[para->u.setgpio_para.ID].GPIOPort,  \
                    BoardGPIO[para->u.setgpio_para.ID].GPIONum, \
                    &BoardGPIO[para->u.setgpio_para.ID].GPIOPara);

    return AEC_OK;
}


static AT_ERROR_CODE sysiogetcfg(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    char *modestr[]={"Input","Output"};
    char *pullstr[]={"pull none","pull up","pull down"};
    at_dump("OI1 driver level is %d\r\n",BoardGPIO[0].GPIOPara.driving);
    at_dump("OI1 mode is %s\r\n",modestr[BoardGPIO[0].GPIOPara.mode]);
    at_dump("OI1 pull is %s\r\n",pullstr[BoardGPIO[0].GPIOPara.pull]);

    at_dump("OI2 driver level is %d\r\n",BoardGPIO[1].GPIOPara.driving);
    at_dump("OI2 mode is %s\r\n",modestr[BoardGPIO[1].GPIOPara.mode]);
    at_dump("OI2 pull is %s\r\n",pullstr[BoardGPIO[1].GPIOPara.pull]);

    at_dump("OI3 driver level is %d\r\n",BoardGPIO[2].GPIOPara.driving);
    at_dump("OI3 mode is %s\r\n",modestr[BoardGPIO[2].GPIOPara.mode]);
    at_dump("OI3 pull is %s\r\n",pullstr[BoardGPIO[2].GPIOPara.pull]);

    return AEC_OK;
}


static AT_ERROR_CODE syssetiodir(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.setiodir_para.ID > 2)
        return AEC_PARA_ERROR;

    if(para->u.setiodir_para.mode <= 1)
        BoardGPIO[para->u.setiodir_para.ID].GPIOPara.mode = para->u.setiodir_para.mode;
    else
        return AEC_PARA_ERROR;

    HAL_GPIO_Init(BoardGPIO[para->u.setiodir_para.ID].GPIOPort,     \
                    BoardGPIO[para->u.setiodir_para.ID].GPIONum,    \
                    &BoardGPIO[para->u.setiodir_para.ID].GPIOPara);

    return AEC_OK;
}

static AT_ERROR_CODE syssetgpio(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.writeiodata_para.ID > 2)
        return AEC_PARA_ERROR;

    if(para->u.writeiodata_para.data == 0)
    {
        HAL_GPIO_WritePin(BoardGPIO[para->u.writeiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.writeiodata_para.ID].GPIONum, \
                        GPIO_PIN_LOW);
    }
    else
    {
        HAL_GPIO_WritePin(BoardGPIO[para->u.writeiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.writeiodata_para.ID].GPIONum, \
                        GPIO_PIN_HIGH);
    }

    return AEC_OK;
}

static AT_ERROR_CODE sysreadgpio(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.readiodata_para.ID > 2)
        return AEC_PARA_ERROR;

    at_dump("Level is %d\r\n",HAL_GPIO_ReadPin(BoardGPIO[para->u.readiodata_para.ID].GPIOPort,  \
                        BoardGPIO[para->u.readiodata_para.ID].GPIONum));
    return AEC_OK;
}

