bouffalolab/bl_iot_sdk_matter/components/stage/atcmd/at_bl602/functions.c
#if 0
static AT_ERROR_CODE deleteap(at_callback_para_t *para, at_callback_rsp_t *rsp)
{
    if(para->u.deleteap_para.apnum > SYSINFO_HISTORY_AP_MAX)
        return AEC_PARA_ERROR;

    if(delete_history_ap(para->u.deleteap_para.apnum) == -1)
    {
        return AEC_CMD_FAIL;
    }
    else
        return AEC_OK;
}
#endif

int OTA_start = 0;
void occur(uint32_t evt, uint32_t data, void *arg)
{
    int idx = EVENT_SUBTYPE(evt);
    switch (idx) {
    case NET_CTRL_MSG_WLAN_CONNECTED:
        net_evevt_state = NET_CTRL_MSG_WLAN_CONNECTED;
        if(OTA_start == 0)
            at_dump("+EVT:2\n");
        break;
    case NET_CTRL_MSG_WLAN_DISCONNECTED:
        net_evevt_state = NET_CTRL_MSG_WLAN_DISCONNECTED;
        if(OTA_start == 0)
            at_dump("+EVT:3\n");
        break;
    case NET_CTRL_MSG_WLAN_SCAN_SUCCESS:
        break;
    case NET_CTRL_MSG_WLAN_CONNECT_FAILED:
        break;
    case NET_CTRL_MSG_NETWORK_UP:
        if(net_evevt_state == NET_CTRL_MSG_NETWORK_UP)
            return;
        net_evevt_state = NET_CTRL_MSG_NETWORK_UP;
        if(OTA_start == 0)
            at_dump("+EVT:4\n");
        break;
    case NET_CTRL_MSG_NETWORK_DOWN:

        break;
    case NET_CTRL_MSG_WLAN_SCAN_FAILED:
    case NET_CTRL_MSG_WLAN_4WAY_HANDSHAKE_FAILED:
        break;
    default:
        break;
    }

    if(idx >= 0 && idx < TABLE_SIZE(event)) {
        if (at_event(idx)) {
            if(OTA_start == 0)
            at_dump("msg:%d\r\n%s\r\n", idx, event[idx]);
        }
    } else {
        FUN_DEBUG("Unsupported.\r\n");
    }

}

TaskHandle_t ap_task_ctrl_thread;
static int create_port;
void tcp_server_task(void *pvParameters)
{
    while (1) {
        ap_socket_task(create_port);
    }
}

void ap_server_task(int port)
{
    create_port = port;

    if (xTaskCreate(tcp_server_task,
                    "tcp_server_task",
                    1024,
                    NULL,
                    10,
                    &ap_task_ctrl_thread) != pdPASS) {
        printf("thread create error\n");
    }
}

void ap_task_delete(void)
{
    vTaskDelete(ap_task_ctrl_thread);
}
#endif
